package us.feliscat.text.analyzer.mor.mecab

import org.junit.Test
import org.scalatest.junit.AssertionsForJUnit
import us.feliscat.text.StringOption

/**
  * @author K. Sakamoto
  *         Created on 2017/05/29
  */
class UnidicMecabTestSuite extends AssertionsForJUnit {
  @Test
  def testAnalysisResult(): Unit = {
    val result: String = UnidicMecab.analysisResult(
      StringOption(
        "運輸・通信手段の発展が，アジア・アフリカの植民地化をうながした。"
      )
    ).get
    assert(
      result ==
        """運輸	名詞,普通名詞,一般,*,*,*,ウンユ,運輸,運輸,ウンユ,運輸,ウンユ,漢,*,*,*,*,ウンユ,ウンユ,ウンユ,ウンユ,*,*,1,C1,*
          |・	補助記号,一般,*,*,*,*,,・,・,,・,,記号,*,*,*,*,・,・,,,*,*,*,*,*
          |通信	名詞,普通名詞,サ変可能,*,*,*,ツウシン,通信,通信,ツーシン,通信,ツーシン,漢,*,*,*,*,ツウシン,ツウシン,ツウシン,ツウシン,*,*,0,C2,*
          |手段	名詞,普通名詞,一般,*,*,*,シュダン,手段,手段,シュダン,手段,シュダン,漢,*,*,*,*,シュダン,シュダン,シュダン,シュダン,*,*,1,C1,*
          |の	助詞,格助詞,*,*,*,*,ノ,の,の,ノ,の,ノ,和,*,*,*,*,ノ,ノ,ノ,ノ,*,*,*,名詞%F1,*
          |発展	名詞,普通名詞,サ変可能,*,*,*,ハッテン,発展,発展,ハッテン,発展,ハッテン,漢,*,*,*,*,ハッテン,ハッテン,ハッテン,ハッテン,*,*,0,C2,*
          |が	助詞,格助詞,*,*,*,*,ガ,が,が,ガ,が,ガ,和,*,*,*,*,ガ,ガ,ガ,ガ,*,*,*,"動詞%F2@0,名詞%F1",*
          |，	補助記号,読点,*,*,*,*,,，,，,,，,,記号,*,*,*,*,,,,,*,*,*,*,*
          |アジア	名詞,普通名詞,一般,*,*,*,世界史用語辞書,世界史用語辞書,basyo,basyo,地域,地域,固,*,*,*,*
          |・	補助記号,一般,*,*,*,*,,・,・,,・,,記号,*,*,*,*,・,・,,,*,*,*,*,*
          |アフリカ	名詞,普通名詞,一般,*,*,*,世界史用語辞書,世界史用語辞書,basyo,basyo,地域,地域,固,*,*,*,*
          |の	助詞,格助詞,*,*,*,*,ノ,の,の,ノ,の,ノ,和,*,*,*,*,ノ,ノ,ノ,ノ,*,*,*,名詞%F1,*
          |植民地	名詞,普通名詞,一般,*,*,*,世界史用語辞書,世界史用語辞書,syakaigainen,syakaigainen,土地が担うロール@役割@土地,土地が担うロール@役割@土地,固,*,*,*,*
          |化	接尾辞,名詞的,サ変可能,*,*,*,カ,化,化,カ,化,カ,漢,*,*,*,*,カ,カ,カ,カ,*,*,*,C4,*
          |を	助詞,格助詞,*,*,*,*,ヲ,を,を,オ,を,オ,和,*,*,*,*,ヲ,ヲ,ヲ,ヲ,*,*,*,"動詞%F2@0,名詞%F1,形容詞%F2@-1",*
          |うながし	動詞,一般,*,*,五段-サ行,連用形-一般,ウナガス,促す,うながし,ウナガシ,うながす,ウナガス,和,*,*,*,*,ウナガシ,ウナガス,ウナガシ,ウナガス,*,*,"0,3",C2,*
          |た	助動詞,*,*,*,助動詞-タ,終止形-一般,タ,た,た,タ,た,タ,和,*,*,*,*,タ,タ,タ,タ,*,*,*,"動詞%F2@1,形容詞%F4@-2",*
          |。	補助記号,句点,*,*,*,*,,。,。,,。,,記号,*,*,*,*,,,,,*,*,*,*,*
          |EOS
          |""".stripMargin)
  }
}
